Revit 2027 API
LoadCombination.IsThirdPartyGenerated Property
 Indicates if the load combination was created by API.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsThirdPartyGenerated { get; }
Public ReadOnly Property IsThirdPartyGenerated As Boolean
	Get
public:
property bool IsThirdPartyGenerated {
	bool get ();
}
member IsThirdPartyGenerated : bool with get
Property Value
Boolean
See Also
Reference
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace